# Використовуємо офіційний образ Node.js
FROM node:20-slim

# Встановлюємо робочу директорію
WORKDIR /usr/src/app

# Копіюємо файли залежностей
COPY package*.json ./

# Встановлюємо залежності (включаючи mysql2 та dotenv)
RUN npm install --production

# Копіюємо весь інший код (включаючи іконки, html та swagger)
COPY . .

# Створюємо папку для кешу фотографій
RUN mkdir -p ./cache

# Експортуємо порт (збігається з тим, що в .env)
EXPOSE 3000

# Запуск додатка
# Використовуємо аргументи за замовчуванням, які підхоплюють змінні оточення
CMD ["npm", "start"]