# Використовуємо офіційний стабільний образ Node.js
FROM node:20-slim

# Створюємо робочу директорію всередині контейнера
WORKDIR /usr/src/app

COPY package*.json ./

# Встановлюємо залежності
RUN npm install --production

# Копіюємо весь вихідний код у контейнер
COPY . .

# Створюємо папку для кешу всередині контейнера (щоб вона точно була)
RUN mkdir -p ./cache

# Відкриваємо порт (хоча ми вкажемо його при запуску, це як документація)
EXPOSE 3000

# Запускаємо додаток. 
# Ми використовуємо "exec" форму для коректної обробки сигналів завершення
ENTRYPOINT ["node", "main.js"]

# Значення за замовчуванням для аргументів (їх можна змінити при запуску)
CMD ["--host", "0.0.0.0", "-p", "3000", "-c", "./cache"]